<!DOCTYPE html>
<html>
	<head>
		<meta charset="utf-8">
		<title>ДЗ №3</title>
	  <style> p {text-indent: 20px; margin-top: 0em; margin-bottom: 0em} </style>
	</head>
   <body>
		<?php 
		//=================================================================
		echo "<b>Задание N1</b> (числа диапазона 0-100 кратные 3)</br>";				
		$i=0;
		while ($i <= 100)
			{
				if ($i%3==0) echo "$i, ";
				$i++;
			}
		echo "</br></br>"; 
		//=================================================================
		echo "<b>Задание N2</b></br>";				
		$i=0;
		do
		{
			if ($i%2==0) 
			{
				if ($i<>0) echo "$i - четное число<br/>";
					else echo "$i - это нуль<br/>";
			}	
				else echo "$i - нечетное число<br/>";
			$i++;
		} while ($i <= 10);
		echo "</br>"; 
		//=================================================================
		echo "<b>Задание N3*</b></br>";	// print тоже работает	
		for ($i = 0; $i < 10; echo_dima ($i++)) {}
		function echo_dima($i)
			{
				echo "$i, "; 
				return;
			}
		echo "</br></br>"; 	
		//=================================================================
		echo "<b>Задание N4</b></br>";
		$ua = array
			(
			"Киевская область" => array("Киев","Белая Церковь","Борисполь","Буча","Бровары","Боярка","Васильков","Фастов","Обухов","Бородянка","Яготин","Переяслов-Хмельницкий"),
			"Запорожская область" => array("Запорожье","Энергодар","Мелитополь","Кириловка","Акимовка","Бердянск","Орехов","Васильевка(Таврическая)","Токмак","Михайловка"),
			"Николаевская область"=> array("Николаев","Новая Одесса","Очаков","Южный","Вознесенск","Южноукраинск"),
			"Херсонская область" => array("Херсон","Новая Каховка","Каховка","Голая Пристань","Скадовск"),
			"Донецкая область" => array("Донецк","Красноармейск","Краматорск","Артемовск","Константиновка","Макеевка","Шахтерск","Торез","Мариуполь","Волноваха","Ясиноватая","Горловка","Енакиево","Амвросимовка","Моспино","Докучаевск","Курахово"),
			"Луганская область" => array("Луганск","Алчевск","Красный Луч","Лисичанск","Счастье","Лугутино","Петровское","Антрацит","Стаханов","Ковшаровка","Свтово","Старобельск"),
			"Харьковская область" => array("Харьков","Дергачи","Песочин","Мерефа","Новая Водолага","Первомайск","Балаклея","Комсомольское","Красноград","Карловка","Чугуев"),
			"Одесская область" => array("Одесса","Ильичевск","Фонтанка","Нерубайское","Великодолинское","Маяки","Теплодар","Овидиополь","Беляевка","Великий дальник")
			);		
		foreach ($ua as $city => $region)
		{
			echo ("$city:");
			echo ("<p>");
				foreach ($region as $ua_city)
					echo("$ua_city, ");
			echo ("</p>");
		}
		echo "</br>";
		//==================================================================
		echo "<b>Задание N5*</b></br>"; //интереснее было бы еще не выводить области в которых нет таких городов
		foreach ($ua as $city => $region)
		{
			$i=0;
			foreach ($region as $ua_city) if ($ua_city[0]=="К") $i++;	
			if ($i>0)
			{
				echo ("$city:");
				echo ("<p>");
					foreach ($region as $ua_city)
							if ($ua_city[0]=="К")  echo("$ua_city, ");
				echo ("</p>");
			}
		}
		echo "</br>";
		//==================================================================
		echo "<b>Задание N6</b></br>"; 	
			$l = array('а'=>'a', 'б'=>'b', 'в'=>'v', 'г'=>'g', 'д'=>'d', 
						'е'=>'e', 'ё'=>'yo', 'ж'=>'gh', 'з'=>'zh', 'и'=>'i', 
						'й'=>'y', 'к'=>'k', 'л'=>'l', 'м'=>'m', 'н'=>'n', 
						'о'=>'o', 'п'=>'p', 'р'=>'r', 'с'=>'s', 'т'=>'t', 
						'у'=>'u', 'ф'=>'f', 'х'=>'h', 'ц'=>'ts', 'ч'=>'tch', 
						'ш'=>'sh', 'щ'=>'stch', 'ъ'=>'', 'ь'=>'', 'э'=>'e', 
						'ы'=>'y', 'ю'=>'yu', 'я'=>'ya', 
						'А'=>'A', 'Б'=>'B', 'В'=>'V', 'Г'=>'G', 'Д'=>'D', 
						'Е'=>'E', 'Ё'=>'Yo', 'Ж'=>'Gh', 'З'=>'Zh', 'И'=>'I', 
						'К'=>'K', 'Л'=>'L', 'М'=>'M', 'Н'=>'N', 
						'О'=>'O', 'П'=>'P', 'Р'=>'R', 'С'=>'S', 'Т'=>'T', 
						'У'=>'U', 'Ф'=>'F', 'Х'=>'H', 'Ц'=>'Ts', 'Ч'=>'Tch', 
						'Ш'=>'Sh', 'Щ'=>'Stch','Э'=>'E', 
						'Ю'=>'Yu', 'Я'=>'Ya');
		echo $s="Напишите функцию транслитерации строк."; echo "</br>";	

		function trans ($s)
		{
			$i=0; $s_trans=""; global $l;
			while ($i<strlen($s))
			{
				$key = $s[$i];
				$s_trans = $s_trans.$l[$key];
				$i++;
			}
			return $s_trans;
		}
		echo trans($s),"</br></br>";
		//==================================================================
		echo "<b>Задание N7</b></br>";
		echo $s="Напишите функцию, которая заменяет в строке пробелы на подчеркивания и
				возвращает видоизмененную строчку."; echo "</br>";		
		function bsp ($s)
		{
			while ($i<strlen($s))
			{
				if ($s[$i]==" ") $s[$i]="_";
				$s_bsp = $s_bsp.$s[$i];
				$i++;
			}	
			return $s_bsp;
		}
		echo bsp($s),"</br></br>";
		//==================================================================
		echo "<b>Задание N8</b></br>";		
		echo $s="статьи, в блогах."; echo "</br>";	
		function trans_bsp ($s)
		{
			$i=0; $s_trans=""; global $l;
			while ($i<strlen($s))
			{
				$key = $s[$i];
				if ($s[$i]==" ") $s_trans = $s_trans.'_';
				$s_trans = "$s_trans$l[$key]";
				$i++;
			}
			return $s_trans;
		}
		echo trans_bsp($s),"</br></br>";		

		?> 
 </body>
</html>